DemonTu/ALL_SmartBatterySwitch_CC2640/simplelink/ble_cc26xx_2_01_01_44627/Projects/ble/SimpleBLEPeripheral/CC26xx/IAR/Application/CC2640/configPkg/package/cfg/appBLE_prm3.c
/*
 *  ======== ti_sysbios_family_arm_cc26xx_Power_XOSC_HF_clockFunc ========
 */
Void ti_sysbios_family_arm_cc26xx_Power_XOSC_HF_clockFunc(UArg arg0)
{
    Bool readyToCal;
    UInt32 timeout;
    UInt key;

    key = ti_sysbios_hal_Hwi_disable();

    /* if pending switch has already been made, just send out notifications */
    if (ti_sysbios_family_arm_cc26xx_Power_Module__state__V.xoscPending ==
        FALSE) {

        if (ti_sysbios_family_arm_cc26xx_Power_calibrateRCOSC) {
            /* initiate RCOSC calibration */
            readyToCal =
                ti_sysbios_family_arm_cc26xx_Power_initiateCalibration();
        }

        /* notify clients that were waiting for a switch notification */
        ti_sysbios_family_arm_cc26xx_Power_notify(
            ti_sysbios_family_arm_cc26xx_Power_XOSC_HF_SWITCHED);

        /* if ready to start first cal measurment, do it now */
        if (ti_sysbios_family_arm_cc26xx_Power_calibrateRCOSC) {
            if (readyToCal == TRUE) {
                ti_sysbios_family_arm_cc26xx_Power_startFirstMeasurement();
            }
        }
    }

    /* else, if HF ready to switch, do it now ... */
    else if (OSCHF_AttemptToSwitchToXosc()) {

        ti_sysbios_family_arm_cc26xx_Power_Module__state__V.xoscPending = FALSE;

        if (ti_sysbios_family_arm_cc26xx_Power_calibrateRCOSC) {
            /* initiate RCOSC calibration */
            readyToCal =
                ti_sysbios_family_arm_cc26xx_Power_initiateCalibration();
        }

        /* now notify clients that were waiting for a switch notification */
        ti_sysbios_family_arm_cc26xx_Power_notify(
            ti_sysbios_family_arm_cc26xx_Power_XOSC_HF_SWITCHED);

        /* if ready to start first cal measurment, do it now */
        if (ti_sysbios_family_arm_cc26xx_Power_calibrateRCOSC) {
            if (readyToCal == TRUE) {
                ti_sysbios_family_arm_cc26xx_Power_startFirstMeasurement();
            }
        }
    }

    /* else, wait some more, then see if can switch ... */
    else {
        /* calculate wait timeout in units of ticks */
        timeout = ti_sysbios_family_arm_cc26xx_Power_retryWaitXOSC_HF /
            ti_sysbios_knl_Clock_tickPeriod;
        if (timeout == 0) {
            timeout = 1;   /* wait at least 1 tick */
        }

        /* re-start Clock object with retry timeout */
        ti_sysbios_knl_Clock_setTimeout(
            ti_sysbios_family_arm_cc26xx_Power_Module_State_xoscClockObj(),
            timeout);
        ti_sysbios_knl_Clock_start(
            ti_sysbios_family_arm_cc26xx_Power_Module_State_xoscClockObj());
    }

    ti_sysbios_hal_Hwi_restore(key);
}

/*
 *  ======== ti_sysbios_family_arm_cc26xx_Power_XOSC_HF ========
 */
UInt ti_sysbios_family_arm_cc26xx_Power_XOSC_HF (UInt action)
{
    UInt32 timeout;

    if (action == ENABLE) {
        if (OSCClockSourceGet(OSC_SRC_CLK_HF) != OSC_XOSC_HF) {
            OSCHF_TurnOnXosc();

            ti_sysbios_family_arm_cc26xx_Power_Module__state__V.xoscPending =
                TRUE;

            /* calculate wait timeout in units of ticks */
            timeout = ti_sysbios_family_arm_cc26xx_Power_initialWaitXOSC_HF /
                ti_sysbios_knl_Clock_tickPeriod;
            if (timeout == 0) {
                timeout = 1;   /* wait at least 1 tick */
            }

            /* start Clock object with initial timeout */
            ti_sysbios_knl_Clock_stop(
                ti_sysbios_family_arm_cc26xx_Power_Module_State_xoscClockObj());
            ti_sysbios_knl_Clock_setTimeout(
                ti_sysbios_family_arm_cc26xx_Power_Module_State_xoscClockObj(),
                timeout);
            ti_sysbios_knl_Clock_start(
                ti_sysbios_family_arm_cc26xx_Power_Module_State_xoscClockObj());
        }
    }

    /* when release XOSC_HF, auto switch to RCOSC_HF */
    else {
        OSCHF_SwitchToRcOscTurnOffXosc();
    }
    return (0);
}

/*
 *  ======== ti_sysbios_family_arm_cc26xx_Power_isDependencyActive ========
 */
Bool ti_sysbios_family_arm_cc26xx_Power_isDependencyActive (Power_Resource
    resourceID)
{
    Bool status = TRUE;

    /* check if the special XOSC_HF resource ...*/
    if(resourceID == XOSC_HF) {

        /* check to see if XOSC_HF is the active source */
        if(OSCClockSourceGet(OSC_SRC_CLK_HF) != OSC_XOSC_HF) {
            status = FALSE;
        }
    }

    /* else, all other resources ... */
    else {

       /* resource is active if dependency count != 0 */
        if(ti_sysbios_family_arm_cc26xx_Power_refCount[resourceID] == 0) {
            status = FALSE;
        }
    }

    return (status);
}

/*
 *  ======== ti_sysbios_family_arm_cc26xx_Power_NOP (UInt action) ========
 */
UInt ti_sysbios_family_arm_cc26xx_Power_NOP (UInt action)
{
    return (0);
}

Fxn ti_sysbios_family_arm_cc26xx_Power_resourceHandlers[3] =
{
    (Fxn) ti_sysbios_family_arm_cc26xx_Power_RFCORECLKS,
    (Fxn) ti_sysbios_family_arm_cc26xx_Power_XOSC_HF,
    (Fxn) ti_sysbios_family_arm_cc26xx_Power_NOP
};

/*
 * ======== ti.sysbios.rts.MemAlloc TEMPLATE ========
 */




#if defined(__ti__)

#pragma FUNC_EXT_CALLED(malloc);
#pragma FUNC_EXT_CALLED(memalign);
#pragma FUNC_EXT_CALLED(free);
#pragma FUNC_EXT_CALLED(calloc);
#pragma FUNC_EXT_CALLED(realloc);

#define ATTRIBUTE

#elif defined(__IAR_SYSTEMS_ICC__)

#define ATTRIBUTE

#else

#define ATTRIBUTE __attribute__ ((used))

#endif


#include <xdc/std.h>

#include <xdc/runtime/Memory.h>
#include <xdc/runtime/Error.h>

#include <string.h>

#if defined(__GNUC__) && !defined(__ti__)

#include <reent.h>

#endif

/*
 * Header is a union to make sure that the size is a power of 2.
 *
 * On the MSP430 small model (MSP430X), size_t is 2 bytes, which makes
 * the size of this struct 6 bytes.
 */
typedef union Header {
    struct {
        Ptr   actualBuf;
        SizeT size;
    } header;
    UArg pad[2];	/* 4 words on 28L, 8 bytes on most others */
} Header;

/*
 *  ======== malloc ========
 */
Void ATTRIBUTE *malloc(SizeT size)
{
    Header *packet;
    xdc_runtime_Error_Block eb;

