DemonTu/ALL_SmartBatterySwitch_CC2640/simplelink/ble_cc26xx_2_01_01_44627/Projects/ble/SimpleBLEPeripheral/CC26xx/IAR/Application/CC2640/configPkg/package/cfg/appBLE_prm3.c
/* Module__loggerFxn4__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Boot_Module__loggerFxn4__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Boot_Module__loggerFxn4 ti_sysbios_family_arm_cc26xx_Boot_Module__loggerFxn4__C = ((CT__ti_sysbios_family_arm_cc26xx_Boot_Module__loggerFxn4)0);

/* Module__loggerFxn8__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Boot_Module__loggerFxn8__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Boot_Module__loggerFxn8 ti_sysbios_family_arm_cc26xx_Boot_Module__loggerFxn8__C = ((CT__ti_sysbios_family_arm_cc26xx_Boot_Module__loggerFxn8)0);

/* Module__startupDoneFxn__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Boot_Module__startupDoneFxn__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Boot_Module__startupDoneFxn ti_sysbios_family_arm_cc26xx_Boot_Module__startupDoneFxn__C = ((CT__ti_sysbios_family_arm_cc26xx_Boot_Module__startupDoneFxn)0);

/* Object__count__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Boot_Object__count__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Boot_Object__count ti_sysbios_family_arm_cc26xx_Boot_Object__count__C = 0;

/* Object__heap__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Boot_Object__heap__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Boot_Object__heap ti_sysbios_family_arm_cc26xx_Boot_Object__heap__C = 0;

/* Object__sizeof__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Boot_Object__sizeof__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Boot_Object__sizeof ti_sysbios_family_arm_cc26xx_Boot_Object__sizeof__C = 0;

/* Object__table__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Boot_Object__table__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Boot_Object__table ti_sysbios_family_arm_cc26xx_Boot_Object__table__C = 0;


/*
 * ======== ti.sysbios.family.arm.cc26xx.Power INITIALIZERS ========
 */

/* Module__state__V */
#if defined (__ICCARM__)
#pragma location = ".data_ti_sysbios_family_arm_cc26xx_Power_Module__state__V"
#endif
#if defined(__GNUC__) && !(defined(__MACH__) && defined(__APPLE__))
#ifndef __TI_COMPILER_VERSION__
ti_sysbios_family_arm_cc26xx_Power_Module_State__ ti_sysbios_family_arm_cc26xx_Power_Module__state__V __attribute__ ((section(".data_ti_sysbios_family_arm_cc26xx_Power_Module__state__V")));
#endif
#endif
ti_sysbios_family_arm_cc26xx_Power_Module_State__ ti_sysbios_family_arm_cc26xx_Power_Module__state__V = {
    (xdc_UInt32)0x0,  /* constraintsMask */
    ti_sysbios_family_arm_cc26xx_Power_ACTIVE,  /* state */
    0,  /* xoscPending */
    {
        {
            ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_family_arm_cc26xx_Power_Module__state__V.Object_field_notifyQ.elem)),  /* next */
            ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_family_arm_cc26xx_Power_Module__state__V.Object_field_notifyQ.elem)),  /* prev */
        },  /* elem */
    },  /* Object_field_notifyQ */
    {
        {
            ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_family_arm_cc26xx_Power_Module__state__V.Object_field_xoscClockObj.elem)),  /* next */
            ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_knl_Clock_Module__state__V.Object_field_clockQ.elem)),  /* prev */
        },  /* elem */
        (xdc_UInt32)0x0,  /* timeout */
        (xdc_UInt32)0x0,  /* currTimeout */
        (xdc_UInt32)0x0,  /* period */
        0,  /* active */
        ((xdc_Void(*)(xdc_UArg))((xdc_Fxn)ti_sysbios_family_arm_cc26xx_Power_defaultClockFunc__E)),  /* fxn */
        ((xdc_UArg)(0x0)),  /* arg */
    },  /* Object_field_clockObj */
    {
        {
            ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_family_arm_cc26xx_Power_Module__state__V.Object_field_lfClockObj.elem)),  /* next */
            ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_family_arm_cc26xx_Power_Module__state__V.Object_field_clockObj.elem)),  /* prev */
        },  /* elem */
        (xdc_UInt32)0x0,  /* timeout */
        (xdc_UInt32)0x0,  /* currTimeout */
        (xdc_UInt32)0x0,  /* period */
        0,  /* active */
        ((xdc_Void(*)(xdc_UArg))((xdc_Fxn)ti_sysbios_family_arm_cc26xx_Power_XOSC_HF_clockFunc__E)),  /* fxn */
        ((xdc_UArg)(0x0)),  /* arg */
    },  /* Object_field_xoscClockObj */
    {
        {
            ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_knl_Clock_Module__state__V.Object_field_clockQ.elem)),  /* next */
            ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_family_arm_cc26xx_Power_Module__state__V.Object_field_xoscClockObj.elem)),  /* prev */
        },  /* elem */
        (xdc_UInt32)0x2710,  /* timeout */
        (xdc_UInt32)0x2710,  /* currTimeout */
        (xdc_UInt32)0x0,  /* period */
        1,  /* active */
        ((xdc_Void(*)(xdc_UArg))((xdc_Fxn)ti_sysbios_family_arm_cc26xx_Power_LF_clockFunc__E)),  /* fxn */
        ((xdc_UArg)(0x0)),  /* arg */
    },  /* Object_field_lfClockObj */
};

/* Module__diagsEnabled__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__diagsEnabled__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__diagsEnabled ti_sysbios_family_arm_cc26xx_Power_Module__diagsEnabled__C = (xdc_Bits32)0x80;

/* Module__diagsIncluded__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__diagsIncluded__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__diagsIncluded ti_sysbios_family_arm_cc26xx_Power_Module__diagsIncluded__C = (xdc_Bits32)0x80;

/* Module__diagsMask__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__diagsMask__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__diagsMask ti_sysbios_family_arm_cc26xx_Power_Module__diagsMask__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_Module__diagsMask)0);

/* Module__gateObj__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__gateObj__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__gateObj ti_sysbios_family_arm_cc26xx_Power_Module__gateObj__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_Module__gateObj)0);

