DemonTu/ALL_SmartBatterySwitch_CC2640/simplelink/ble_cc26xx_2_01_01_44627/Projects/ble/SimpleBLEPeripheral/CC26xx/IAR/Application/CC2640/configPkg/package/cfg/appBLE_prm3.c
/* Module__gatePrms__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__gatePrms__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__gatePrms ti_sysbios_family_arm_cc26xx_Power_Module__gatePrms__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_Module__gatePrms)0);

/* Module__id__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__id__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__id ti_sysbios_family_arm_cc26xx_Power_Module__id__C = (xdc_Bits16)0x29;

/* Module__loggerDefined__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__loggerDefined__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerDefined ti_sysbios_family_arm_cc26xx_Power_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__loggerObj__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerObj ti_sysbios_family_arm_cc26xx_Power_Module__loggerObj__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerObj)0);

/* Module__loggerFxn0__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn0__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn0 ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn0__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn1__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn1 ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn1__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn2__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn2 ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn2__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn2)0);

/* Module__loggerFxn4__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn4__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn4 ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn4__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn4)0);

/* Module__loggerFxn8__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn8__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn8 ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn8__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_Module__loggerFxn8)0);

/* Module__startupDoneFxn__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Module__startupDoneFxn__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Module__startupDoneFxn ti_sysbios_family_arm_cc26xx_Power_Module__startupDoneFxn__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_Module__startupDoneFxn)0);

/* Object__count__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Object__count__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Object__count ti_sysbios_family_arm_cc26xx_Power_Object__count__C = 0;

/* Object__heap__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Object__heap__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Object__heap ti_sysbios_family_arm_cc26xx_Power_Object__heap__C = 0;

/* Object__sizeof__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Object__sizeof__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Object__sizeof ti_sysbios_family_arm_cc26xx_Power_Object__sizeof__C = 0;

/* Object__table__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_Object__table__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_Object__table ti_sysbios_family_arm_cc26xx_Power_Object__table__C = 0;

/* idle__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_idle__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_idle ti_sysbios_family_arm_cc26xx_Power_idle__C = 1;

/* A_tooManyCallsReleaseConstraint__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_A_tooManyCallsReleaseConstraint__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_A_tooManyCallsReleaseConstraint ti_sysbios_family_arm_cc26xx_Power_A_tooManyCallsReleaseConstraint__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_tooManyCallsReleaseDependency__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_A_tooManyCallsReleaseDependency__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_A_tooManyCallsReleaseDependency ti_sysbios_family_arm_cc26xx_Power_A_tooManyCallsReleaseDependency__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* resumeTicksSTANDBY__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_resumeTicksSTANDBY__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_resumeTicksSTANDBY ti_sysbios_family_arm_cc26xx_Power_resumeTicksSTANDBY__C = (xdc_UInt)0x4b;

/* totalTicksSTANDBY__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_totalTicksSTANDBY__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_totalTicksSTANDBY ti_sysbios_family_arm_cc26xx_Power_totalTicksSTANDBY__C = (xdc_UInt)0x64;

/* wakeDelaySTANDBY__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_wakeDelaySTANDBY__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_wakeDelaySTANDBY ti_sysbios_family_arm_cc26xx_Power_wakeDelaySTANDBY__C = (xdc_UInt)0x82;

/* initialWaitXOSC_HF__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_initialWaitXOSC_HF__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_initialWaitXOSC_HF ti_sysbios_family_arm_cc26xx_Power_initialWaitXOSC_HF__C = (xdc_UInt)0x32;

/* retryWaitXOSC_HF__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_retryWaitXOSC_HF__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_retryWaitXOSC_HF ti_sysbios_family_arm_cc26xx_Power_retryWaitXOSC_HF__C = (xdc_UInt)0x32;

/* calibrateRCOSC__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_calibrateRCOSC__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_calibrateRCOSC ti_sysbios_family_arm_cc26xx_Power_calibrateRCOSC__C = 1;

