DemonTu/ALL_SmartBatterySwitch_CC2640/simplelink/ble_cc26xx_2_01_01_44627/Projects/ble/SimpleBLEPeripheral/CC26xx/IAR/Application/CC2640/configPkg/package/cfg/appBLE_prm3.c
/* clockFunc__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_clockFunc__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_clockFunc ti_sysbios_family_arm_cc26xx_Power_clockFunc__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_clockFunc)((xdc_Fxn)ti_sysbios_family_arm_cc26xx_Power_defaultClockFunc__E));

/* lfClockFunc__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_lfClockFunc__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_lfClockFunc ti_sysbios_family_arm_cc26xx_Power_lfClockFunc__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_lfClockFunc)((xdc_Fxn)ti_sysbios_family_arm_cc26xx_Power_LF_clockFunc__E));

/* xoscClockFunc__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_xoscClockFunc__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_xoscClockFunc ti_sysbios_family_arm_cc26xx_Power_xoscClockFunc__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_xoscClockFunc)((xdc_Fxn)ti_sysbios_family_arm_cc26xx_Power_XOSC_HF_clockFunc__E));

/* notifyTrapFunc__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Power_notifyTrapFunc__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Power_notifyTrapFunc ti_sysbios_family_arm_cc26xx_Power_notifyTrapFunc__C = ((CT__ti_sysbios_family_arm_cc26xx_Power_notifyTrapFunc)((xdc_Fxn)ti_sysbios_family_arm_cc26xx_Power_defaultNotifyTrapFunc__E));


/*
 * ======== ti.sysbios.family.arm.cc26xx.Timer INITIALIZERS ========
 */


/* Object__PARAMS__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C"
__FAR__ const ti_sysbios_family_arm_cc26xx_Timer_Params ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C = {
    sizeof (ti_sysbios_family_arm_cc26xx_Timer_Params), /* __size */
    0, /* __self */
    0, /* __fxns */
    (xdc_runtime_IInstance_Params*)&ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C.__iprms, /* instance */
    ti_sysbios_interfaces_ITimer_RunMode_CONTINUOUS,  /* runMode */
    ti_sysbios_interfaces_ITimer_StartMode_AUTO,  /* startMode */
    ((xdc_UArg)0),  /* arg */
    (xdc_UInt32)0x0,  /* period */
    ti_sysbios_interfaces_ITimer_PeriodType_MICROSECS,  /* periodType */
    {
        (xdc_Bits32)0x0,  /* hi */
        (xdc_Bits32)0x0,  /* lo */
    },  /* extFreq */
    ((ti_sysbios_family_arm_m3_Hwi_Params*)0),  /* hwiParams */
    {
        sizeof (xdc_runtime_IInstance_Params), /* __size */
        0,  /* name */
    },  /* instance */
};

/* Module__root__V */
ti_sysbios_family_arm_cc26xx_Timer_Module__ ti_sysbios_family_arm_cc26xx_Timer_Module__root__V = {
    {&ti_sysbios_family_arm_cc26xx_Timer_Module__root__V.link,  /* link.next */
    &ti_sysbios_family_arm_cc26xx_Timer_Module__root__V.link},  /* link.prev */
};

/* Object__table__V */
ti_sysbios_family_arm_cc26xx_Timer_Object__ ti_sysbios_family_arm_cc26xx_Timer_Object__table__V[1] = {
    {/* instance#0 */
        0,
        1,  /* staticInst */
        (xdc_Int)0x0,  /* id */
        ti_sysbios_interfaces_ITimer_StartMode_AUTO,  /* startMode */
        (xdc_UInt32)0xa7c5,  /* period */
        ((xdc_UArg)0),  /* arg */
        ((xdc_Void(*)(xdc_UArg))((xdc_Fxn)ti_sysbios_knl_Clock_doTick__I)),  /* tickFxn */
        {
            (xdc_Bits32)0x0,  /* hi */
            (xdc_Bits32)0x10000,  /* lo */
        },  /* frequency */
        (ti_sysbios_family_arm_m3_Hwi_Handle)&ti_sysbios_family_arm_m3_Hwi_Object__table__V[1],  /* hwi */
        (xdc_UInt64)0xa7c5,  /* period64 */
        (xdc_UInt64)0x0,  /* savedCurrCount */
        (xdc_UInt64)0xa7c5,  /* prevThreshold */
        (xdc_UInt64)0xa7c5,  /* nextThreshold */
    },
};

/* Module__state__V */
#if defined (__ICCARM__)
#pragma location = ".data_ti_sysbios_family_arm_cc26xx_Timer_Module__state__V"
#endif
#if defined(__GNUC__) && !(defined(__MACH__) && defined(__APPLE__))
#ifndef __TI_COMPILER_VERSION__
ti_sysbios_family_arm_cc26xx_Timer_Module_State__ ti_sysbios_family_arm_cc26xx_Timer_Module__state__V __attribute__ ((section(".data_ti_sysbios_family_arm_cc26xx_Timer_Module__state__V")));
#endif
#endif
ti_sysbios_family_arm_cc26xx_Timer_Module_State__ ti_sysbios_family_arm_cc26xx_Timer_Module__state__V = {
    (xdc_UInt)0x0,  /* availMask */
    (ti_sysbios_family_arm_cc26xx_Timer_Handle)&ti_sysbios_family_arm_cc26xx_Timer_Object__table__V[0],  /* handle */
};

/* Module__diagsEnabled__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Timer_Module__diagsEnabled__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__diagsEnabled ti_sysbios_family_arm_cc26xx_Timer_Module__diagsEnabled__C = (xdc_Bits32)0x80;

/* Module__diagsIncluded__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Timer_Module__diagsIncluded__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__diagsIncluded ti_sysbios_family_arm_cc26xx_Timer_Module__diagsIncluded__C = (xdc_Bits32)0x80;

/* Module__diagsMask__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Timer_Module__diagsMask__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__diagsMask ti_sysbios_family_arm_cc26xx_Timer_Module__diagsMask__C = ((CT__ti_sysbios_family_arm_cc26xx_Timer_Module__diagsMask)0);

/* Module__gateObj__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Timer_Module__gateObj__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__gateObj ti_sysbios_family_arm_cc26xx_Timer_Module__gateObj__C = ((CT__ti_sysbios_family_arm_cc26xx_Timer_Module__gateObj)0);

/* Module__gatePrms__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Timer_Module__gatePrms__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__gatePrms ti_sysbios_family_arm_cc26xx_Timer_Module__gatePrms__C = ((CT__ti_sysbios_family_arm_cc26xx_Timer_Module__gatePrms)0);

/* Module__id__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Timer_Module__id__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__id ti_sysbios_family_arm_cc26xx_Timer_Module__id__C = (xdc_Bits16)0x2a;

/* Module__loggerDefined__C */
#pragma location = ".const_ti_sysbios_family_arm_cc26xx_Timer_Module__loggerDefined__C"
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__loggerDefined ti_sysbios_family_arm_cc26xx_Timer_Module__loggerDefined__C = 0;

