DemonTu/ALL_SmartBatterySwitch_CC2640/simplelink/ble_cc26xx_2_01_01_44627/Projects/ble/SimpleBLEPeripheral/CC26xx/IAR/Application/CC2640/configPkg/package/cfg/appBLE_prm3.c
/* A_taskDisabled__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_taskDisabled__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_taskDisabled ti_sysbios_knl_Task_A_taskDisabled__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_badPriority__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_badPriority__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_badPriority ti_sysbios_knl_Task_A_badPriority__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_badTimeout__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_badTimeout__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_badTimeout ti_sysbios_knl_Task_A_badTimeout__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_badAffinity__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_badAffinity__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_badAffinity ti_sysbios_knl_Task_A_badAffinity__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_sleepTaskDisabled__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_sleepTaskDisabled__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_sleepTaskDisabled ti_sysbios_knl_Task_A_sleepTaskDisabled__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_invalidCoreId__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_invalidCoreId__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_invalidCoreId ti_sysbios_knl_Task_A_invalidCoreId__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* numPriorities__C */
#pragma location = ".const_ti_sysbios_knl_Task_numPriorities__C"
__FAR__ const CT__ti_sysbios_knl_Task_numPriorities ti_sysbios_knl_Task_numPriorities__C = (xdc_UInt)0x6;

/* defaultStackSize__C */
#pragma location = ".const_ti_sysbios_knl_Task_defaultStackSize__C"
__FAR__ const CT__ti_sysbios_knl_Task_defaultStackSize ti_sysbios_knl_Task_defaultStackSize__C = (xdc_SizeT)0x200;

/* defaultStackHeap__C */
#pragma location = ".const_ti_sysbios_knl_Task_defaultStackHeap__C"
__FAR__ const CT__ti_sysbios_knl_Task_defaultStackHeap ti_sysbios_knl_Task_defaultStackHeap__C = 0;

/* allBlockedFunc__C */
#pragma location = ".const_ti_sysbios_knl_Task_allBlockedFunc__C"
__FAR__ const CT__ti_sysbios_knl_Task_allBlockedFunc ti_sysbios_knl_Task_allBlockedFunc__C = ((CT__ti_sysbios_knl_Task_allBlockedFunc)0);

/* initStackFlag__C */
#pragma location = ".const_ti_sysbios_knl_Task_initStackFlag__C"
__FAR__ const CT__ti_sysbios_knl_Task_initStackFlag ti_sysbios_knl_Task_initStackFlag__C = 1;

/* checkStackFlag__C */
#pragma location = ".const_ti_sysbios_knl_Task_checkStackFlag__C"
__FAR__ const CT__ti_sysbios_knl_Task_checkStackFlag ti_sysbios_knl_Task_checkStackFlag__C = 0;

/* deleteTerminatedTasks__C */
#pragma location = ".const_ti_sysbios_knl_Task_deleteTerminatedTasks__C"
__FAR__ const CT__ti_sysbios_knl_Task_deleteTerminatedTasks ti_sysbios_knl_Task_deleteTerminatedTasks__C = 0;

/* hooks__C */
#pragma location = ".const_ti_sysbios_knl_Task_hooks__C"
__FAR__ const CT__ti_sysbios_knl_Task_hooks ti_sysbios_knl_Task_hooks__C = {0, 0};

/* numConstructedTasks__C */
#pragma location = ".const_ti_sysbios_knl_Task_numConstructedTasks__C"
__FAR__ const CT__ti_sysbios_knl_Task_numConstructedTasks ti_sysbios_knl_Task_numConstructedTasks__C = (xdc_UInt)0x0;

/* startupHookFunc__C */
#pragma location = ".const_ti_sysbios_knl_Task_startupHookFunc__C"
__FAR__ const CT__ti_sysbios_knl_Task_startupHookFunc ti_sysbios_knl_Task_startupHookFunc__C = ((CT__ti_sysbios_knl_Task_startupHookFunc)0);


/*
 * ======== ti.sysbios.knl.Task_SupportProxy INITIALIZERS ========
 */


/*
 * ======== ti.sysbios.rom.cortexm.cc26xx.CC26xx INITIALIZERS ========
 */

/* Module__diagsEnabled__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsEnabled__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsEnabled ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsEnabled__C = (xdc_Bits32)0x80;

/* Module__diagsIncluded__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsIncluded__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsIncluded ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsIncluded__C = (xdc_Bits32)0x80;

/* Module__diagsMask__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask)0);

/* Module__gateObj__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj)0);

/* Module__gatePrms__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms)0);

/* Module__id__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__id__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__id ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__id__C = (xdc_Bits16)0x18;

/* Module__loggerDefined__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerDefined__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj)0);

/* Module__loggerFxn0__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2)0);

